/* 11054. 가장 긴 바이토닉 부분 수열
- 요구사항 : 무작위로 숫자가 배치된 수열이 주어졌을 때 가장 긴 바이토닉 부분 수열을 구해라
    - 바이토닉 수열 : 수열 S가 어떤 수 Sk를 기준으로 S1 < S2 < ... Sk-1 < Sk > Sk+1 > ... SN-1 > SN을 만족하는 수열
                    수 하나를 기준으로 그 수까지는 커졌다가 그 수 이후로는 작아지는 수열
- 함수 
    - input : 첫번째줄에는 수열의 크기 n
              두번째줄에는 수열을 이루는 n개의 원소
    - restriction : 1 <= n <= 1,000
                    1 <= 각 원소 <= 1,000
    - output : 주어진 수열에서 가장 긴 바이토닉 부분 수열의 길이 출력
- 점화식 
*/
package BOJ.DP;

public class TheLongestBitonicSubsequence {
    
}
